RT-Thread/rt-thread/bsp/ht32/libraries/usbd_library/src/ht32_usbd_core.c
/*********************************************************************************************************//**
 * @file    ht32_usbd_core.c
 * @version $Rev:: 1684         $
 * @date    $Date:: 2019-05-07 #$
 * @brief   The standard protocol related function of HT32 USB Device Library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "ht32_usbd_core.h"
#include "usb_port.h"


#ifdef USBD_VENDOR_SUPPORT
    #include "ht32_usbd_vendor.c"
#endif

/** @addtogroup HT32_USBD_Library HT32 USB Device Library
  * @{
  */

/** @defgroup USBDCore USB Device Core
  * @brief USB Device Core standard protocol related function
  * @{
  */


/* Private types -------------------------------------------------------------------------------------------*/
/** @defgroup USBDCore_Private_TypesDefinitions USB Device Core private types definitions
  * @{
  */
typedef enum
{
    Device     = 0,
    Interface  = 1,
    Endpoint   = 2,
    Other      = 3,
} USBDCore_Recipient_Enum;

typedef enum
{
    ClearFeature = 0,
    SetFeature   = 1,
} USBDCore_SetClearFeature_Enum;
/**
  * @}
  */

/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup USBDCore_Private_Define USB Device Core private definitions
  * @{
  */
/* USBD Debug mode                                                                                          */
#if (USBDCORE_DEBUG == 1)
    #ifdef RETARGET_IS_USB
        #warning "USB debug mode can not work when retaget to USB Virtual COM. Turn off automatically."
        #undef USBDCORE_DEBUG
        #define USBDCORE_DEBUG 0
    #else
        u32 __DBG_USBCount;
        #warning "USB debug mode has been enabled which degrade the performance."
        #warning "After the debug operation, please remember to turn off USB debug mode."
    #endif
#endif

/** @defgroup USBDCore_STD Definition for standard request
  * @{
  */
#define REQ_00_GET_STAT               ((u16)(0  << 8))
#define REQ_01_CLR_FETU               ((u16)(1  << 8))
#define REQ_03_SET_FETU               ((u16)(3  << 8))
#define REQ_05_SET_ADDR               ((u16)(5  << 8))
#define REQ_06_GET_DESC               ((u16)(6  << 8))
#define REQ_07_SET_DESC               ((u16)(7  << 8))
#define REQ_08_GET_CONF               ((u16)(8  << 8))
#define REQ_09_SET_CONF               ((u16)(9  << 8))
#define REQ_10_GET_INF                ((u16)(10 << 8))
#define REQ_11_SET_INF                ((u16)(11 << 8))
#define REQ_12_SYN_FRME               ((u16)(12 << 8))
/**
  * @}
  */

#define DESC_TYPE_01_DEV              (0x1)
#define DESC_TYPE_02_CONFN            (0x2)
#define DESC_TYPE_03_STR              (0x3)
#define USB_NO_DATA                   (-1)            /*!< For Device.Transfer.sByteLength                  */
#define BMREQUEST_TYPE_MASK           (0x6 << 4)      /*!< bmRequestType[6:5]                               */
#define USB_FEATURE_REMOTE_WAKEUP     (1)

#define MAX_CONTROL_OUT_SIZE          (64)
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------------------------------------*/
static void _USBDCore_PowerHandler(USBDCore_TypeDef *pCore);
static void _USBDCore_Reset(USBDCore_TypeDef *pCore);
static void _USBDCore_Resume(USBDCore_TypeDef *pCore);
static void _USBDCore_Suspend(USBDCore_TypeDef *pCore);
static void _USBDCore_Setup(USBDCore_TypeDef *pCore);
static void _USBDCore_Standard_Request(USBDCore_TypeDef *pCore);
static void _USBDCore_Standard_GetStatus(USBDCore_TypeDef *pCore, USBDCore_Recipient_Enum recipient);
static void _USBDCore_Standard_SetClearFeature(USBDCore_TypeDef *pCore, USBDCore_Recipient_Enum recipient, USBDCore_SetClearFeature_Enum type);
static void _USBDCore_Standard_SetAddress(USBDCore_TypeDef *pCore);
static void _USBDCore_Standard_GetDescriptor(USBDCore_TypeDef *pCore);
static void _USBDCore_Standard_GetConfiguration(USBDCore_TypeDef *pCore);
static void _USBDCore_Standard_SetConfiguration(USBDCore_TypeDef *pCore);
static void _USBDCore_ControlIN(USBDCore_TypeDef *pCore);
static void _USBDCore_ControlOUT(USBDCore_TypeDef *pCore);

/* Private macro -------------------------------------------------------------------------------------------*/
/** @defgroup USBDCore_Private_Macro USB Device Core private macros
  * @{
  */
/**
 * @brief Get self powered bit from Device descriptor
 */
#define _GET_SELFPOWERED_FROM_DESC()     (((pCore->Device.Desc.pConfnDesc[7]) >> 6) & 0x01)
/**
  * @}
  */

/* Private variables ---------------------------------------------------------------------------------------*/
/** @defgroup USBDCore_Private_Variable USB Device Core private variables
  * @{
  */
USBDCore_TypeDef *pUSBCore;
/**
  * @}
  */


/* Global Function -----------------------------------------------------------------------------------------*/
/** @defgroup USBDCore_Exported_Functions USB Device Core exported functions
  * @{
  */
/*********************************************************************************************************//**
  * @brief  USB Core initialization.
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
void USBDCore_Init(USBDCore_TypeDef *pCore)
{
    pUSBCore = pCore;
    pCore->Info.CurrentStatus = USER_USER_USB_STATE_POWERED;
    API_USB_INIT(pCore->pDriver);
    __DBG_USBPrintf("\r\n%06ld \r\n", ++__DBG_USBCount);
    return;
}

