RT-Thread/rt-thread/bsp/ht32/libraries/usbd_library/src/ht32_usbd_core.c
        if (API_USB_EPTn_IS_INT(USBEPTISRFlag))
        {
            API_USB_EPTn_CLR_INT(EPTn);
            API_USB_CLR_EPTn_INT(EPTn);

            if (pCore->Class.CallBack_EPTn[EPTn] != NULL)
            {
                pCore->Class.CallBack_EPTn[EPTn](EPTn);
            }
            /* 在此处调用端点输入输出回调函数*/
            if (USBEPTISRFlag & IDTXIF)
            {
                /* 在此处调用端点输入函数 */
                usbd_ep_in_callback(pCore, (USBD_EPTn_Enum)EPTn);
            }
            else
            {
                /* 在此处调用端点输出函数 */
                usbd_ep_out_callback(pCore, (USBD_EPTn_Enum)EPTn);
            }

        }
    } /* while ((EPTn = API_USB_GET_EPTn_NUM(API_USB_GET_INT())) != USBD_NOEPT)                               */

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Core Main Routine for application.
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
void USBDCore_MainRoutine(USBDCore_TypeDef *pCore)
{
    _USBDCore_PowerHandler(pCore);

    /*--------------------------------------------------------------------------------------------------------*/
    /* Class main routine call back function                                                                  */
    /*--------------------------------------------------------------------------------------------------------*/
    if ((pCore->Class.CallBack_MainRoutine.func != NULL) && (pCore->Info.CurrentStatus == USER_USER_USB_STATE_CONFIGURED))
    {
        pCore->Class.CallBack_MainRoutine.func(pCore->Class.CallBack_MainRoutine.uPara);
    }

    return;
}

/*********************************************************************************************************//**
  * @brief  Return Suspend status
  * @param  pCore: pointer of USB Device
  * @retval TRUE or FALSE
  ***********************************************************************************************************/
u32 USBDCore_IsSuspend(USBDCore_TypeDef *pCore)
{
    return ((pCore->Info.CurrentStatus == USER_USER_USB_STATE_SUSPENDED) ? TRUE : FALSE);
}

/*********************************************************************************************************//**
  * @brief  Return remote wake status which set by SET FEATURE standard command
  * @param  pCore: pointer of USB Device
  * @retval TRUE or FALSE
  ***********************************************************************************************************/
u32 USBDCore_GetRemoteWakeUpFeature(USBDCore_TypeDef *pCore)
{
    return (pCore->Info.CurrentFeature.Bits.bRemoteWakeup);
}

/*********************************************************************************************************//**
  * @brief  Turn on USB power and remote wakeup the Host
  * @retval None
  ***********************************************************************************************************/
void USBDCore_TriggerRemoteWakeup(void)
{
    API_USB_POWER_ON();          /* Turn on USB Power                                                         */
    API_USB_REMOTE_WAKEUP();     /* Generate Remote Wakeup request to Host (RESUME)                           */
    return;
}

/*********************************************************************************************************//**
  * @brief  Get USB Device status
  * @retval USBDCore_Status_Enum
  ***********************************************************************************************************/
USBDCore_Status_Enum USBDCore_GetStatus(void)
{
    return pUSBCore->Info.CurrentStatus;
}

/*********************************************************************************************************//**
  * @brief  Dump memory data for debug purpose.
  * @param  memory: buffer pointer to dump
  * @param  len: dump length
  * @retval None
  ***********************************************************************************************************/
#if (USBDCORE_DEBUG == 1 && USBDCORE_DEBUG_DATA == 1)
void __DBG_USBDump(uc8 *memory, u32 len)
{
    u32 i;
    for (i = 0; i < len; i++)
    {
        if (i % 8 == 0)
        {
            if (i != 0)
            {
                __DBG_USBPrintf("\r\n");
            }
            __DBG_USBPrintf("\t\t");
        }
        __DBG_USBPrintf("%02X ", *((u8 *)(memory + i)));
    }
    __DBG_USBPrintf("\r\n");

    return;
}
#endif
/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup USBDCore_Private_Function USB Device Core private functions
  * @{
  */
/*********************************************************************************************************//**
  * @brief  USB Core Power handler for application.
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_PowerHandler(USBDCore_TypeDef *pCore)
{
    API_USB_POWER_UP(pCore->pDriver, pCore->Info.CurrentFeature.Bits.bSelfPowered);

    if (pCore->Info.CurrentStatus == USER_USER_USB_STATE_SUSPENDED)
    {
        /*------------------------------------------------------------------------------------------------------*/
        /* System Low Power call back function                                                                  */
        /*------------------------------------------------------------------------------------------------------*/
        if (pCore->Power.CallBack_Suspend.func != NULL)
        {
            __DBG_USBPrintf("%06ld >LOWPOWER\r\n", ++__DBG_USBCount);

            pCore->Power.CallBack_Suspend.func(pCore->Power.CallBack_Suspend.uPara);

            __DBG_USBPrintf("%06ld <LOWPOWER\r\n", ++__DBG_USBCount);
        }
    }

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Reset
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Reset(USBDCore_TypeDef *pCore)
{
    USBD_Driver_TypeDef *pDrv = (USBD_Driver_TypeDef *)pCore->pDriver;

    pCore->Device.Transfer.sByteLength = USB_NO_DATA;
    pCore->Info.uCurrentConfiguration = 0;
    pCore->Info.uCurrentInterface = 0;
    pCore->Info.CurrentFeature.Bits.bRemoteWakeup = 0;
    pCore->Info.CurrentStatus = USER_USER_USB_STATE_DEFAULT;
    pCore->Info.uIsDiscardClearFeature = FALSE;

