RT-Thread/rt-thread/bsp/ht32/libraries/usbd_library/src/ht32_usbd_core.c
    API_USB_DEINIT();

    API_USB_POWER_ON();

    /* Endpoint 0 initialization                                                                              */
    API_USB_EPTn_INIT(USBD_EPT0, pCore->pDriver); // To be modify, init from desc

    /* Enable USB interrupt                                                                                   */
    API_USB_ENABLE_INT(pDrv->uInterruptMask);

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Resume
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Resume(USBDCore_TypeDef *pCore)
{
    API_USB_POWER_ON();
    pCore->Info.CurrentStatus = pCore->Info.LastStatus;
    return;
}

/*********************************************************************************************************//**
  * @brief  USB Suspend
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Suspend(USBDCore_TypeDef *pCore)
{
    /*--------------------------------------------------------------------------------------------------------*/
    /* When Device has been suspended, Change CurrentStatus as SUSPEND and then USBDCore_PowerHandler will    */
    /* turn off chip power.                                                                                   */
    /*--------------------------------------------------------------------------------------------------------*/
    if (pCore->Info.CurrentStatus >= USER_USER_USB_STATE_POWERED)
    {
        API_USB_POWER_OFF();
        pCore->Info.LastStatus = pCore->Info.CurrentStatus;
        pCore->Info.CurrentStatus = USER_USER_USB_STATE_SUSPENDED;
    }

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Setup Stage
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Setup(USBDCore_TypeDef *pCore)
{
    pCore->Device.Transfer.Action = USB_ACTION_STALL;
    pCore->Device.Transfer.sByteLength = 0;

    switch (pCore->Device.Request.bmRequestType & BMREQUEST_TYPE_MASK)
    {
    /*------------------------------------------------------------------------------------------------------*/
    /* Standard requests                                                                                    */
    /*------------------------------------------------------------------------------------------------------*/
    case REQ_TYPE_00_STD:
    {
        _USBDCore_Standard_Request(pCore);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* Class requests                                                                                       */
    /*------------------------------------------------------------------------------------------------------*/
    case REQ_TYPE_01_CLS:
    {
        if (pCore->Class.CallBack_ClassRequest != NULL)
        {
            pCore->Class.CallBack_ClassRequest(&(pCore->Device));
        }
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* Vendor requests                                                                                      */
    /*------------------------------------------------------------------------------------------------------*/
    case REQ_TYPE_02_VND:
    {
        if (pCore->Class.CallBack_VendorRequest != NULL)
        {
            pCore->Class.CallBack_VendorRequest(&(pCore->Device));
        }
        /* Add Vendor requests handler here....                                                               */
#ifdef USBD_VENDOR_SUPPORT
        USBDVendor_Request(pCore);
#endif
        break;
    }
    } /* switch (gUSBReq.bmRequestType.byte)                                                                  */

    switch (pCore->Device.Transfer.Action)
    {
    /*------------------------------------------------------------------------------------------------------*/
    /* Control IN                                                                                           */
    /*------------------------------------------------------------------------------------------------------*/
    case USB_ACTION_DATAIN:
    {
        /*----------------------------------------------------------------------------------------------------*/
        /* When the Control IN length is large than the Host required, transfer the length which specified    */
        /* by SETUP Data Packet.                                                                              */
        /*----------------------------------------------------------------------------------------------------*/
        if (pCore->Device.Transfer.sByteLength > pCore->Device.Request.wLength)
        {
            pCore->Device.Transfer.sByteLength = pCore->Device.Request.wLength;
        }
        __DBG_USBPrintf("%06ld EP0IN\t[%02ld]", __DBG_USBCount, pCore->Device.Transfer.sByteLength);

        _USBDCore_ControlIN(pCore);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* Control OUT                                                                                          */
    /*------------------------------------------------------------------------------------------------------*/
    case USB_ACTION_DATAOUT:
    {
        if (pCore->Device.Transfer.sByteLength == 0)
        {
            API_USB_EPTn_WRITE_IN(USBD_EPT0, (u32 *)0, 0);     /* Prepare ZLP ack for Control OUT               */
        }
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* STALL                                                                                                */
    /*------------------------------------------------------------------------------------------------------*/
    default:
    {
        __DBG_USBPrintf("%06ld EP0 STALL\r\n", __DBG_USBCount);

        API_USB_EPTn_SEND_STALL(USBD_EPT0);
        break;
    }
    }

    return;
}

