RT-Thread/rt-thread/bsp/ht32/libraries/usbd_library/src/ht32_usbd_core.c
/*********************************************************************************************************//**
  * @brief  USB Stand Request.
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Standard_Request(USBDCore_TypeDef *pCore)
{
    u16 USBCmd = *((u16 *)(&(pCore->Device.Request)));

    switch (USBCmd)
    {
    /*------------------------------------------------------------------------------------------------------*/
    /* | bRequest             | Data transfer direction | Type                | Recipient   | Data          */
    /*------------------------------------------------------------------------------------------------------*/

    /*------------------------------------------------------------------------------------------------------*/
    /* | 00_Get Status        | 80_Device-to-Host       | 00_Standard Request | 0_Device    | 0080h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_00_GET_STAT | REQ_DIR_01_D2H | REQ_TYPE_00_STD | REQ_REC_00_DEV):
    {
        __DBG_USBPrintf("%06ld GET DST\t[%02d]\r\n", __DBG_USBCount, pCore->Info.CurrentFeature.uByte);
        _USBDCore_Standard_GetStatus(pCore, Device);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 00_Get Status        | 80_Device-to-Host       | 00_Standard Request | 1_Interface | 0081h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_00_GET_STAT | REQ_DIR_01_D2H | REQ_TYPE_00_STD | REQ_REC_01_INF):
    {
        __DBG_USBPrintf("%06ld GET IST\t[%02d]\r\n", __DBG_USBCount, 0);
        _USBDCore_Standard_GetStatus(pCore, Interface);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 00_Get Status        | 80_Device-to-Host       | 00_Standard Request | 2_Endpoint  | 0082h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_00_GET_STAT | REQ_DIR_01_D2H | REQ_TYPE_00_STD | REQ_REC_02_EPT):
    {
        __DBG_USBPrintf("%06ld GET EST\t[%02d]\r\n", __DBG_USBCount, pCore->Device.Request.wIndex);
        _USBDCore_Standard_GetStatus(pCore, Endpoint);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 01_Clear Feature    | 00_Host-to-Device        | 00_Standard Request | 0_Device    | 0100h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_01_CLR_FETU | REQ_DIR_00_H2D | REQ_TYPE_00_STD | REQ_REC_00_DEV):
    {
        __DBG_USBPrintf("%06ld CLR DFEA\t[%02d]\r\n", __DBG_USBCount, pCore->Device.Request.wValueL);
        _USBDCore_Standard_SetClearFeature(pCore, Device, ClearFeature);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 01_Clear Feature     | 00_Host-to-Device       | 00_Standard Request | 2_Endpoint  | 0102h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_01_CLR_FETU | REQ_DIR_00_H2D | REQ_TYPE_00_STD | REQ_REC_02_EPT):
    {
        __DBG_USBPrintf("%06ld CLR EFEA\t[0x%02x]\r\n", __DBG_USBCount, pCore->Device.Request.wIndex);
        _USBDCore_Standard_SetClearFeature(pCore, Endpoint, ClearFeature);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 03_Set Feature       | 00_Host-to-Device       | 00_Standard Request | 0_Device    | 0300h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_03_SET_FETU | REQ_DIR_00_H2D | REQ_TYPE_00_STD | REQ_REC_00_DEV):
    {
        __DBG_USBPrintf("%06ld SET DFEA\t[%02d]\r\n", __DBG_USBCount, pCore->Device.Request.wValueL);
        _USBDCore_Standard_SetClearFeature(pCore, Device, SetFeature);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 03_Set Feature       | 00_Host-to-Device       | 00_Standard Request | 2_Endpoint  | 0302h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_03_SET_FETU | REQ_DIR_00_H2D | REQ_TYPE_00_STD | REQ_REC_02_EPT):
    {
        __DBG_USBPrintf("%06ld SET EFEA\t[%02d]\r\n", __DBG_USBCount, pCore->Device.Request.wIndex);
        _USBDCore_Standard_SetClearFeature(pCore, Endpoint, SetFeature);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 05_Set Address       | 00_Host-to-Device       | 00_Standard Request | 0_Device    | 0500h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_05_SET_ADDR | REQ_DIR_00_H2D | REQ_TYPE_00_STD | REQ_REC_00_DEV):
    {
        __DBG_USBPrintf("%06ld SET ADDR\t[%02d]\r\n", __DBG_USBCount, pCore->Device.Request.wValueL);
        _USBDCore_Standard_SetAddress(pCore);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 06_Get Descriptor    | 80_Device-to-Host       | 00_Standard Request | 0_Device    | 0680h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_06_GET_DESC | REQ_DIR_01_D2H | REQ_TYPE_00_STD | REQ_REC_00_DEV):
    {
        __DBG_USBPrintf("%06ld GET DDESC\t[%02X]\r\n", __DBG_USBCount, pCore->Device.Request.wValueH);
        _USBDCore_Standard_GetDescriptor(pCore);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 06_Get Descriptor    | 80_Device-to-Host       | 00_Standard Request | 1_Interface | 0681h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_06_GET_DESC | REQ_DIR_01_D2H | REQ_TYPE_00_STD | REQ_REC_01_INF):
    {
        __DBG_USBPrintf("%06ld GET IDESC\t[%02X]\r\n", __DBG_USBCount, pCore->Device.Request.wValueH);
        if (pCore->Class.CallBack_ClassGetDescriptor != NULL)
        {
            pCore->Class.CallBack_ClassGetDescriptor((USBDCore_Device_TypeDef *) & (pCore->Device));
        }
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 08_Get Configuration | 80_Host-to-Device       | 00_Standard Request | 0_Device    | 0880h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_08_GET_CONF | REQ_DIR_01_D2H | REQ_TYPE_00_STD | REQ_REC_00_DEV):
    {
        __DBG_USBPrintf("%06ld GET CONF\t[%02X]\r\n", __DBG_USBCount, pCore->Info.uCurrentConfiguration);
        _USBDCore_Standard_GetConfiguration(pCore);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 09_Set Configuration | 00_Host-to-Device       | 00_Standard Request | 0_Device    | 0900h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_09_SET_CONF | REQ_DIR_00_H2D | REQ_TYPE_00_STD | REQ_REC_00_DEV):
    {
        __DBG_USBPrintf("%06ld SET CONF\t[%02X]\r\n", __DBG_USBCount, pCore->Device.Request.wValueL);
        _USBDCore_Standard_SetConfiguration(pCore);
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 11_Set Interface     | 00_Host-to-Device       | 00_Standard Request | 1_Interface | 0B01h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_11_SET_INF | REQ_DIR_00_H2D | REQ_TYPE_00_STD | REQ_REC_01_INF):
    {
        __DBG_USBPrintf("%06ld SET INF\t[%02X]\r\n", __DBG_USBCount, pCore->Device.Request.wValueL);
        if (pCore->Class.CallBack_ClassSetInterface != NULL)
        {
            pCore->Class.CallBack_ClassSetInterface((USBDCore_Device_TypeDef *) & (pCore->Device));
        }
        break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* | 10_Get Interface     | 80_Device-to-Host       | 00_Standard Request | 1_Interface | 0A81h         */
    /*------------------------------------------------------------------------------------------------------*/
    case (REQ_10_GET_INF | REQ_DIR_01_D2H | REQ_TYPE_00_STD | REQ_REC_01_INF):
    {
        __DBG_USBPrintf("%06ld GET INF\t[%02X]\r\n", __DBG_USBCount, pCore->Device.Request.wValueL);
        if (pCore->Class.CallBack_ClassGetInterface != NULL)
        {
            pCore->Class.CallBack_ClassGetInterface((USBDCore_Device_TypeDef *) & (pCore->Device));
        }
        break;
    }
    }

    return;
}

