RT-Thread/rt-thread/bsp/ht32/libraries/usbd_library/src/ht32_usbd_core.c
/*********************************************************************************************************//**
  * @brief  USB Standard Request - GET_STATUS.
  * @param  pCore: pointer of USB Device
  * @param  recipient: Recipient
  *         @arg Device:    0
  *         @arg Interface: 1
  *         @arg Endpoint:  2
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Standard_GetStatus(USBDCore_TypeDef *pCore, USBDCore_Recipient_Enum recipient)
{
    pCore->Device.Transfer.uBuffer[1] = 0;
    switch (recipient)
    {
    case Device:
    {
        pCore->Device.Transfer.uBuffer[0] = pCore->Info.CurrentFeature.uByte;
        break;
    }
    case Interface:
    {
        pCore->Device.Transfer.uBuffer[0] = 0;
        break;
    }
    case Endpoint:
    {
        pCore->Device.Transfer.uBuffer[0] = API_USB_EPTn_GET_HALT((USBD_EPTn_Enum)(pCore->Device.Request.wIndex & 0xF));
        break;
    }
    default:
    {
        return;
    }
    }

    pCore->Device.Transfer.pData = (uc8 *) & (pCore->Device.Transfer.uBuffer);
    pCore->Device.Transfer.sByteLength = 2;
    pCore->Device.Transfer.Action = USB_ACTION_DATAIN;

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Standard Request - SET_FEATURE / CLEAR_FEATURE.
  * @param  pCore: pointer of USB Device
  * @param  recipient: Recipient
  *         @arg Device:    0
  *         @arg Interface: 1
  *         @arg Endpoint:  2
  * @param  type:
  *         @arg ClearFeature: 0
            @arg SerFeature:   1
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Standard_SetClearFeature(USBDCore_TypeDef *pCore,
        USBDCore_Recipient_Enum recipient,
        USBDCore_SetClearFeature_Enum type)
{
    u32 i;
    switch (recipient)
    {
    case Device:
    {
        if (pCore->Device.Request.wValueL == USB_FEATURE_REMOTE_WAKEUP)
        {
            pCore->Info.CurrentFeature.Bits.bRemoteWakeup = type;
            pCore->Device.Transfer.Action = USB_ACTION_DATAIN;
        }
        break;
    }
    case Endpoint:
    {
        i = pCore->Device.Request.wIndex & 0xF;
        if (i != 0)
        {
            if (type == ClearFeature)
            {
                if (pCore->Info.uIsDiscardClearFeature == FALSE)
                {
                    API_USB_EPTn_CLR_HALT((USBD_EPTn_Enum)i);
                    API_USB_EPTn_CLR_DTG((USBD_EPTn_Enum)i);
                }
            }
            else
            {
                API_USB_EPTn_SET_HALT((USBD_EPTn_Enum)i);
            }
        }
        pCore->Device.Transfer.Action = USB_ACTION_DATAIN;
        break;
    }
    default:
    {
        break;
    }
    }

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Standard Request - SET_ADDRESS.
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Standard_SetAddress(USBDCore_TypeDef *pCore)
{
    API_USB_SET_ADDR(pCore->Device.Request.wValueL);
    pCore->Device.Transfer.Action = USB_ACTION_DATAIN;
    pCore->Info.CurrentStatus = USER_USER_USB_STATE_ADDRESS;

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Standard Request - GET_DESCRIPTOR.
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Standard_GetDescriptor(USBDCore_TypeDef *pCore)
{
    u32 value = pCore->Device.Request.wValueH;
    uc8 *pTemp;

    switch (value)
    {
    case DESC_TYPE_01_DEV:
    {
        pCore->Device.Transfer.pData = pCore->Device.Desc.pDeviceDesc;
        pCore->Device.Transfer.sByteLength = *(pCore->Device.Desc.pDeviceDesc);
        pCore->Device.Transfer.Action = USB_ACTION_DATAIN;
        break;
    }
    case DESC_TYPE_02_CONFN:
    {
        pCore->Device.Transfer.pData = pCore->Device.Desc.pConfnDesc;
        pCore->Device.Transfer.sByteLength = *(u16 *)((pCore->Device.Desc.pConfnDesc) + 2);
        pCore->Device.Transfer.Action = USB_ACTION_DATAIN;
        break;
    }
    case DESC_TYPE_03_STR:
    {
        value = pCore->Device.Request.wValueL;
        if (value < pCore->Device.Desc.uStringDescNumber)
        {
            if (*(pCore->Device.Desc.ppStringDesc + value) != NULL)
            {
                pTemp = *(pCore->Device.Desc.ppStringDesc + value);
                pCore->Device.Transfer.pData = (uc8 *)(pTemp);
                pCore->Device.Transfer.sByteLength = *(pTemp);
                pCore->Device.Transfer.Action = USB_ACTION_DATAIN;
            }
        }
        break;
    }
    }

#ifdef USBD_VENDOR_SUPPORT
    USBDVendor_StandardGetDescriptor(pCore);
#endif

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Standard Request - GET_CONFIGURATION.
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Standard_GetConfiguration(USBDCore_TypeDef *pCore)
{
    pCore->Device.Transfer.pData = &(pCore->Info.uCurrentConfiguration);
    pCore->Device.Transfer.sByteLength = 1;
    pCore->Device.Transfer.Action = USB_ACTION_DATAIN;

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Standard Request - SET_CONFIGURATION.
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_Standard_SetConfiguration(USBDCore_TypeDef *pCore)
{
    u32 i;

    pCore->Info.uCurrentConfiguration = pCore->Device.Request.wValueL;
    pCore->Device.Transfer.Action = USB_ACTION_DATAIN;

    /* Endpoint n settings                                                                                    */
    for (i = 1; i < MAX_EP_NUM; i++)
    {
        API_USB_EPTn_INIT((USBD_EPTn_Enum)i, pCore->pDriver); // To be modify, init from desc
    }

