RT-Thread/rt-thread/bsp/ht32/libraries/usbd_library/src/ht32_usbd_core.c
    pCore->Info.CurrentStatus = USER_USER_USB_STATE_CONFIGURED;

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Control IN transfer.
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_ControlIN(USBDCore_TypeDef *pCore)
{
    s32 EP0INLen = API_USB_GET_CTRL_IN_LEN();
    u32 len;

    if (pCore->Device.Transfer.sByteLength != USB_NO_DATA && pCore->Device.Transfer.Action == USB_ACTION_DATAIN)
    {
        if (pCore->Device.Transfer.sByteLength >= EP0INLen)
        {
            len = EP0INLen;
            pCore->Device.Transfer.sByteLength -= len;
        }
        else
        {
            len = pCore->Device.Transfer.sByteLength;
            pCore->Device.Transfer.sByteLength = USB_NO_DATA;
            pCore->Device.Transfer.Action = USB_ACTION_DATAOUT;
        }

        __DBG_USBPrintf("[%02ld]\r\n", len);
        __DBG_USBDump((uc8 *)pCore->Device.Transfer.pData, len);

        API_USB_EPTn_WRITE_IN(USBD_EPT0, (u32 *)pCore->Device.Transfer.pData, len);
        pCore->Device.Transfer.pData = pCore->Device.Transfer.pData + len;
    }
    else
    {
        __DBG_USBPrintf("[-1]\r\n");
    }

    return;
}

/*********************************************************************************************************//**
  * @brief  USB Control OUT transfer.
  * @param  pCore: pointer of USB Device
  * @retval None
  ***********************************************************************************************************/
static void _USBDCore_ControlOUT(USBDCore_TypeDef *pCore)
{
    u32 len;

    if (pCore->Device.Transfer.sByteLength != USB_NO_DATA && pCore->Device.Transfer.Action == USB_ACTION_DATAOUT)
    {
        len = API_USB_EPTn_READ_OUT(USBD_EPT0, (u32 *)pCore->Device.Transfer.pData, MAX_CONTROL_OUT_SIZE);

        __DBG_USBPrintf("[%02ld]\r\n", len);
        __DBG_USBDump((uc8 *)pCore->Device.Transfer.pData, len);

        pCore->Device.Transfer.pData = pCore->Device.Transfer.pData + len;
        pCore->Device.Transfer.sByteLength -= len;

        if (pCore->Device.Transfer.sByteLength == 0)
        {
            pCore->Device.Transfer.Action = USB_ACTION_DATAIN;
            if (pCore->Device.Transfer.CallBack_OUT.func != NULL)
            {
                pCore->Device.Transfer.CallBack_OUT.func(pCore->Device.Transfer.CallBack_OUT.uPara);
                pCore->Device.Transfer.CallBack_OUT.func = NULL;
            }
            pCore->Device.Transfer.sByteLength = USB_NO_DATA;
            API_USB_EPTn_WRITE_IN(USBD_EPT0, (u32 *)0, 0);
        }
    }
    else
    {
        __DBG_USBPrintf("[-1]\r\n");
    }

    return;
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
